export const LEADER_MSG = {
  start_message: {
    msg: "بداية ممتازة يا صديقي! 🚀 استمر، وكل خطوة تقربك من صدارة الليدر بورد.",
    emoji: "👋",
  }, // 0 - 20%

  mid_message: {
    msg: "عظيم يا صديقي! أداءك في هذا الكورس أفضل من 60% من باقي الطلبة. كمّل بنفس الحماس، وأريد أن أرى اسمك في الليدر بورد قريبًا!",
    emoji: "💪",
  }, // 20 - 50%

  end_message: {
    msg: "مستوى رائع! 🌟 أنت من أفضل المتقدمين في الكورس. بقي القليل لتثبت مكانك بين الأوائل وتحافظ على اسمك في الليدر بورد.",
    emoji: "🏆",
  }, // 50 - 100%
};
